#include "r_cg_macrodriver.h"
#include "delay.h"

/*******************************************************************************
* 函数名 : delay_us.
* 描述   : 微秒延时.
* 输入   : None.
* 输出   : None.
* 返回值 : 无.
*******************************************************************************/
void delay_us(uint16_t utime)
{
  uint16_t i = utime;
  uint16_t j = 3;
  while(i--)
  {
    while(j--)
      asm("nop");
    j = 3;
  }
}
/*******************************************************************************
* 函数名 : delay_ms.
* 描述   : 微秒延时.
* 输入   : None.
* 输出   : None.
* 返回值 : 无.
*******************************************************************************/
void delay_ms(uint16_t utime)
{
  uint16_t i = utime;
  uint16_t j = 8000;
  while(i--)
  {
    while(j--)
      asm("nop");
    j = 6000;
  }
}
